## Proyecto_SQL_Daniel_Vllanueva ##

In [1]:
%pip install mysql-connector-python

%pip install pymysql

Requirement already satisfied: mysql-connector-python in c:\users\fx506\anaconda3\lib\site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\fx506\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pymysql in c:\users\fx506\anaconda3\lib\site-packages (1.0.3)
Note: you may need to restart the kernel to use updated packages.

In [2]:
# Importar librerias necesarias

import csv
import pandas as pd
import numpy as np
import mysql.connector as conn
from sqlalchemy import create_engine

In [3]:
### "Leo todos mis archivos para visualizar mis data frames" ###

In [4]:
dfa = pd.read_csv('C:\\Users\\FX506\\Proyect_SQL\\data\\actor.csv')

In [5]:
dfa

     actor_id first_name     last_name          last_update
0           1   PENELOPE       GUINESS  2006-02-15 04:34:33
1           2       NICK      WAHLBERG  2006-02-15 04:34:33
2           3         ED         CHASE  2006-02-15 04:34:33
3           4   JENNIFER         DAVIS  2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33
..        ...        ...           ...                  ...
195       196       BELA        WALKEN  2006-02-15 04:34:33
196       197      REESE          WEST  2006-02-15 04:34:33
197       198       MARY        KEITEL  2006-02-15 04:34:33
198       199      JULIA       FAWCETT  2006-02-15 04:34:33
199       200      THORA        TEMPLE  2006-02-15 04:34:33

[200 rows x 4 columns]

In [6]:
dfa = dfa.drop(['last_update'], axis=1)

In [7]:
dfa.columns # le di a drop last_update pero me salió error y aun así se borro. lo pongo para que sepan.

Index(['actor_id', 'first_name', 'last_name'], dtype='object')

In [8]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int64
 1   first_name  200 non-null    object
 2   last_name   200 non-null    object
dtypes: int64(1), object(2)
memory usage: 4.8+ KB

In [9]:
dfa.isnull().sum()

actor_id      0
first_name    0
last_name     0
dtype: int64

In [10]:
dfc = pd.read_csv('C:\\Users\\FX506\\Proyect_SQL\\data\\category.csv')

In [11]:
dfc

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [12]:
dfc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

In [13]:
dfc.isnull().sum()

category_id    0
name           0
last_update    0
dtype: int64

In [14]:
dfc = dfc.drop(['last_update'], axis=1)

In [15]:
dfc.columns

Index(['category_id', 'name'], dtype='object')

In [16]:
dff = pd.read_csv('C:\\Users\\FX506\\Proyect_SQL\\data\\film.csv')

In [17]:
dff

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,NaN,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",2006-02-15 05:03:42
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,NaN,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",2006-02-15 05:03:42
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,NaN,6,0.99,105,10.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,NaN,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,NaN,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [18]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

In [19]:
dff.isnull().sum()

film_id                    0
title                      0
description                0
release_year               0
language_id                0
original_language_id    1000
rental_duration            0
rental_rate                0
length                     0
replacement_cost           0
rating                     0
special_features           0
last_update                0
dtype: int64

In [20]:
dff = dff.drop(['original_language_id', 'last_update'], axis=1)

In [21]:
dff.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features'],
      dtype='object')

In [22]:
dff.isnull().sum()

film_id             0
title               0
description         0
release_year        0
language_id         0
rental_duration     0
rental_rate         0
length              0
replacement_cost    0
rating              0
special_features    0
dtype: int64

In [23]:
dfi = pd.read_csv('C:\\Users\\FX506\\Proyect_SQL\\data\\inventory.csv')

In [24]:
dfi

     inventory_id  film_id  store_id          last_update
0               1        1         1  2006-02-15 05:09:17
1               2        1         1  2006-02-15 05:09:17
2               3        1         1  2006-02-15 05:09:17
3               4        1         1  2006-02-15 05:09:17
4               5        1         2  2006-02-15 05:09:17
..            ...      ...       ...                  ...
995           996      222         2  2006-02-15 05:09:17
996           997      222         2  2006-02-15 05:09:17
997           998      222         2  2006-02-15 05:09:17
998           999      223         2  2006-02-15 05:09:17
999          1000      223         2  2006-02-15 05:09:17

[1000 rows x 4 columns]

In [25]:
dfi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [26]:
dfi.isnull().sum()

inventory_id    0
film_id         0
store_id        0
last_update     0
dtype: int64

In [27]:
dfi = dfi.drop(['last_update'], axis=1)

In [28]:
dfi.columns

Index(['inventory_id', 'film_id', 'store_id'], dtype='object')

In [29]:
dfl = pd.read_csv('C:\\Users\\FX506\\Proyect_SQL\\data\\language.csv')

In [30]:
dfl

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [31]:
dfl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [32]:
dfl.isnull().sum()

language_id    0
name           0
last_update    0
dtype: int64

In [33]:
dfl = dfl.drop(['last_update'], axis=1)

In [34]:
dfl.columns

Index(['language_id', 'name'], dtype='object')

In [35]:
dfo = pd.read_csv('C:\\Users\\FX506\\Proyect_SQL\\data\\old_HDD.csv')

In [36]:
dfo

    first_name last_name                  title  release_year  category_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

[1000 rows x 5 columns]

In [37]:
dfo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

In [38]:
dfo.isnull().sum()

first_name      0
last_name       0
title           0
release_year    0
category_id     0
dtype: int64

In [39]:
dfo.columns

Index(['first_name', 'last_name', 'title', 'release_year', 'category_id'], dtype='object')

In [40]:
dfr = pd.read_csv('C:\\Users\\FX506\\Proyect_SQL\\data\\rental.csv')

In [41]:
dfr #### mergear para que el film id este aca

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
995,997,2005-05-31 00:08:25,4243,216,2005-06-02 00:17:25,2,2006-02-15 21:30:53
996,998,2005-05-31 00:16:57,3395,389,2005-06-01 22:41:57,1,2006-02-15 21:30:53
997,999,2005-05-31 00:25:10,4433,413,2005-06-03 06:05:10,2,2006-02-15 21:30:53
998,1000,2005-05-31 00:25:56,1774,332,2005-06-08 19:42:56,2,2006-02-15 21:30:53
999,1001,2005-05-31 00:46:31,1498,64,2005-06-06 06:14:31,2,2006-02-15 21:30:53

In [42]:
dfr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

In [43]:
dfr.isnull().sum()

rental_id       0
rental_date     0
inventory_id    0
customer_id     0
return_date     0
staff_id        0
last_update     0
dtype: int64

In [44]:
dfr = dfr.drop(['last_update'], axis=1)

In [45]:
dfr.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id'],
      dtype='object')

In [46]:
#### empezaré a hacer las tablas desde acá  ####

In [47]:
conexion = conn.connect(host='localhost',
                        user='root',
                        passwd='Dfvt1906$')    # conexion al servidor

cursor = conexion.cursor()

In [48]:
db = conn.connect(host='localhost',
                  user='root',
                  passwd='Dfvt1906$',
                  database='proyect_sql')  # conexion a la base de datos

cursor = db.cursor()

In [49]:
def insertor(df,table):
    nombre_table2=table
    nombre_columns2=','.join(df.columns)
    for e in range(len(df)):
        valores=tuple(df.iloc[e].values)
        insert_query = f'insert into {nombre_table2} ({nombre_columns2}) values {valores}'
        cursor.execute(insert_query)

In [50]:
cursor.execute('drop table if exists actor;')
query='''
create table actor (
actor_id int primary key not null,
first_name varchar(40), 
last_name varchar(40))'''
cursor.execute(query)

In [51]:
insertor(dfa,'actor')

In [52]:
cursor.execute('select * from actor limit 2;')
for x in cursor:
    print(x)

(1, 'PENELOPE', 'GUINESS')
(2, 'NICK', 'WAHLBERG')

In [53]:
cursor.execute('DROP TABLE IF EXISTS film;')
query = '''
CREATE TABLE film (
film_id INT PRIMARY KEY NOT NULL,
title VARCHAR(40), 
description VARCHAR(200),
release_year VARCHAR(45),
language_id INT,
rental_duration INT,
rental_rate VARCHAR(45),
length INT,
replacement_cost FLOAT,
rating VARCHAR(45),
special_features VARCHAR(70)
);
'''
cursor.execute(query)
insertor(dff,'film')

In [54]:
cursor.execute('select * from film limit 2;')
for x in cursor:
    print(x)

(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', '2006', 1, 6, '0.99', 86, 20.99, 'PG', 'Deleted Scenes,Behind the Scenes')
(2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', '2006', 1, 3, '4.99', 48, 12.99, 'G', 'Trailers,Deleted Scenes')

In [103]:
dfi

     inventory_id  film_id  store_id
0               1        1         1
1               2        1         1
2               3        1         1
3               4        1         1
4               5        1         2
..            ...      ...       ...
995           996      222         2
996           997      222         2
997           998      222         2
998           999      223         2
999          1000      223         2

[1000 rows x 3 columns]

In [102]:
cursor.execute('DROP TABLE IF EXISTS inventory;')
query = '''
CREATE TABLE inventory (
inventory_id INT PRIMARY KEY NOT NULL,
film_id int,
store_id int
);
'''
cursor.execute(query)
insertor(dfi,'inventory')

In [104]:
cursor.execute('select * from inventory limit 2;')
for x in cursor:
    print(x)

(1, 1, 1)
(2, 1, 1)

In [105]:
dfo.columns

Index(['first_name', 'last_name', 'title', 'release_year', 'category_id'], dtype='object')

In [110]:
cursor.execute('DROP TABLE IF EXISTS old_hdd;')
query = '''
CREATE TABLE old_hdd (
first_name VARCHAR(45),
last_name VARCHAR(45),
title VARCHAR(40), 
release_year VARCHAR(45),
category_id INT
);
'''
cursor.execute(query)
insertor(dfo,'old_hdd')

In [111]:
cursor.execute('select * from old_hdd limit 2;')
for x in cursor:
    print(x)

('PENELOPE', 'GUINESS', 'ACADEMY DINOSAUR', '2006', 6)
('PENELOPE', 'GUINESS', 'ANACONDA CONFESSIONS', '2006', 2)

In [112]:
dfo

    first_name last_name                  title  release_year  category_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

[1000 rows x 5 columns]

In [114]:
#'''cursor.execute('DROP TABLE IF EXISTS old_hdd_has_film;')
#query = '''
#CREATE TABLE old_hdd_has_film (

#);
#'''
#cursor.execute(query)
#insertor(dfo,'old_hdd_has_film')'''

In [115]:
dfr.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id'],
      dtype='object')

In [120]:
cursor.execute('DROP TABLE IF EXISTS rental;')
query = '''
CREATE TABLE rental (
rental_id int,
rental_date VARCHAR(45),
inventory_id int,
customer_id int,
return_date VARCHAR(45),
staff_id int
);
'''
cursor.execute(query)
insertor(dfr,'rental')

In [118]:
dfr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB

In [122]:
cursor.execute('select * from rental limit 2;')
for x in cursor:
    print(x)

(1, '2005-05-24 22:53:30', 367, 130, '2005-05-26 22:04:30', 1)
(2, '2005-05-24 22:54:33', 1525, 459, '2005-05-28 19:40:33', 1)

In [55]:
#dfo = dfo.merge(dff[['title', 'film_id']], on='title', how='left')

In [56]:
#dfo

In [57]:
#dfo = dfo.merge(dfa[['first_name', 'last_name', 'actor_id']], on=['first_name','last_name'], how='left')

In [58]:
#dfo

In [59]:
#dfo.isna().sum()

In [60]:
#dfo = dfo.merge(dfc[['category_id', 'name']], on=['category_id'], how='left')

In [61]:
#dfo

In [62]:
###dfo.drop(columns=['name_x', 'name_y'], inplace=True)### esto era porque le di a merge mas de una vez y lo dejo por si vuelve a suceder

In [63]:
#dfo

In [64]:
#dfo.columns

In [65]:
#dfo = dfo.reindex(columns=["actor_id", "first_name", "last_name","title","film_id", "category_id", "name", "release_year"])

In [66]:
#dfo

In [67]:
#dfo = dfo.rename(columns={"name": "movie_genre"})

In [68]:
#dfo ### tabla de old_HDD ya limpiada y ordenada

In [69]:
### hacer el merge de inventory en rental ###

In [70]:
#dfr = dfr.merge(dfi[['inventory_id', 'film_id']], on='inventory_id', how='inner')

In [71]:
#dfr

In [72]:
#dfr.isnull().sum()

In [73]:
#dfi = pd.merge(dfi, dff[["film_id", "title"]], on="film_id")

In [74]:
#dfi

In [75]:
#dfi = dfi.rename(columns={"film_id": "film_film_id"})

In [76]:
#dfr = dfr.rename(columns={"film_id": "invetory_film_film_id"})

In [77]:
#dfr = dfr.rename(columns={"inventory_id": "invetory_inventory_id"})

In [78]:
#dfo = dfo.rename(columns={"actor_id": "actor_actor__id"})

In [79]:
#dfa.columns

In [80]:
#dfc.columns

In [81]:
#dff.columns

In [82]:
#dfo.columns

In [83]:
#dfi.columns

In [84]:
#dfl.columns

In [85]:
#dfr.columns

In [86]:
### conecto con sql mi dataframes limpios ###

In [87]:

#cursor.execute('show databases;')

#for e in cursor:
    #print(e)

In [88]:
#cursor.execute('show tables;')

#for e in cursor:
  ##  print(e)

In [89]:
### empezar a probar

In [90]:
#str_conn = 'mysql+pymysql://root:Dfvt1906$@localhost:3306/proyect_sql'

#cursor = create_engine(str_conn)

In [91]:
#dfa.to_sql(name='actor', 
        #    con=cursor,
         #   if_exists='replace',   # 'append'..
          #  index=True
           #)

In [92]:
#dfa.to_csv('actor.csv', index=False)

In [93]:
#dff.to_csv('film.csv', index=False)

In [94]:
#dfo.to_csv('old_HDD', index=False)

In [95]:
#cursor.execute('drop table if exists lang')
#query='''
#create table lang(
#language_id int primary key not null,
#name varchar(40))'''
#cursor.execute(query)
#insertor(dfl,'lang')

In [96]:
#cursor.execute('drop table if exists lang')

In [97]:
#dff2=dff.drop(columns='release_year')

In [98]:
#'''cursor.execute('drop table if exists film')
#query='''
#create table film(
#film_id int primary key not null, 
#title varchar(40), 
#description varchar(200), 
#language_id int, 
#rental_duration int,
#rental_rate float, 
#length int, 
#replacement_cost float, 
#rating varchar(40),
#special_features varchar(100),
#foreign key (language_id) references lang(language_id))'''
#cursor.execute(query)
#insertor(dff2,'film')'''

In [99]:
#cursor.execute('drop table if exists film')